//
//  GS8BrailleCode.swift
//  
//
//  Created by Logan Richards on 12/11/21.
//

import Foundation

public final class GS8BrailleCode : Subsitution {
    public init?(caseSensitive: Bool = true, memorizeCase: Bool = false, unknownSymbolHandling: UnknownSymbolHandlingMode = .Ignore, createNGroups: Int? = nil, seperator: String = "") {
        
        //TODO: open quote -> "⣄"
        //TODO: close quote -> "⠄"
        //TODO: |x| (abs. value) : "⢳",
        //TODO: line ∫ : "⡮",
        //TODO: closed ∫ : "⢮",
        //TODO: Baraille Markup?
        let key: [String : String] = ["a" : "⠁", "b" : "⠃", "c" : "⠉", "d" : "⠙", "e" : "⠑", "f" : "⠋", "g" : "⠛", "h" : "⠓", "i" : "⠊", "j" : "⠚", "k" : "⠅", "l" : "⠇", "m" : "⠍", "n" : "⠝", "o" : "⠕", "p" : "⠏", "q" : "⠟", "r" : "⠗", "s" : "⠎", "t" : "⠞", "u" : "⠥", "v" : "⠧", "w" : "⠺", "x" : "⠭", "y" : "⠽", "z" : "⠵", "A" : "⡁", "B" : "⡃", "C" : "⡉", "D" : "⡙", "E" : "⡑", "F" : "⡋", "G" : "⡛", "H" : "⡓", "I" : "⡊", "J" : "⡚", "K" : "⡅", "L" : "⡇", "M" : "⡍", "N" : "⡝", "O" : "⡕", "P" : "⡏", "Q" : "⡟", "R" : "⡗", "S" : "⡎", "T" : "⡞", "U" : "⡥", "V" : "⡧", "W" : "⡺", "X" : "⡭", "Y" : "⡽", "Z" : "⡵", "0" : "⠬", "1" : "⠡", "2" : "⠣", "3" : "⠩", "4" : "⠹", "5" : "⠱", "6" : "⠫", "7" : "⠻", "8" : "⠳", "9" : "⠪", "α" : "⢁", "β" : "⢃", "γ" : "⢛", "δ" : "⢙", "ε" : "⢑", "ζ" : "⢵", "η" : "⢱", "θ" : "⢹", "ι" : "⢊", "κ" : "⢅", "λ" : "⢇", "μ" : "⢍", "ν" : "⢝", "ξ" : "⢭", "ο" : "⢕", "π" : "⢏", "ρ" : "⢗", "σ" : "⢎", "τ" : "⢞", "υ" : "⢥", "φ" : "⢋", "χ" : "⢯", "ψ" : "⢽", "ω" : "⢺", "Γ" : "⣛", "Δ" : "⣙", "Θ" : "⣹", "Λ" : "⣇", "Ξ" : "⣭", "Π" : "⣏", "Σ" : "⣎", "Υ" : "⣥", "Φ" : "⣋", "Ψ" : "⣽", "Ω" : "⣺", "(" : "⢆", ")" : "⡘", "[" : "⣦", "]" : "⣴", "?" : "⠶", "\"" : "⣒", "$" : "⡼", "&" : "⠯", "@" : "⢌", "\\" : "⣡", "^" : "⡐", "_" : "⢂", "`" : "⣄", "{" : "⣷", "}" : "⣾", "~" : "⣠", "#" : "⠼", "%" : "⠞", "*" : "⢜", "+" : "⡒", "/" : "⣌", "<" : "⢔", "=" : "⣶", ">" : "⡢", "×" : "⣂", "·" : "⢒", "÷" : "⣐", "•" : "⢷", "©" : "⢉", "†" : "⢻", "‡" : "⢿", "£" : "⢼", "∼" : "⡶", "≈" : "⢶", "≡" : "⣿", "∝" : "⣤", "∞" : "⢓", "∫" : "⣮", "〈" : "⣪", "〉" : "⣕", "∇" : "⣩", "∂" : "⢩", "…" : "⢤", "→" : "⡦", "←" : "⢴", "○" : "⢚", "ℵ" : "⣱", "∈" : "⣑", "⇌" : "⡾", "√" : "⢪", "⊥" : "⢀⣆", "∥" : "⢰⡆", "∠" : "⢀⣔", "☐" : "⢰⣲", "⊿" : "⢰⣄", "∪" : "⢰⣰", "∩" : "⢰⢲", "⊂" : "⢰⣒", "⊃" : "⢐⣲"]
        
        super.init(key: key, caseSensitive: caseSensitive, memorizeCase: memorizeCase, unknownSymbolHandling: unknownSymbolHandling, createNGroups: createNGroups, seperator: seperator, homophonic: true)
    }
}
